refactor: add mermaid diagrams
